/*********************************************************************************************
给出一个字符串和一个模式串，高效的将模式串中出现的所有字符在原字符串中删除,假设模式串
为"wlcm"
@检查原字符串中的每个值，如果在字串中，则跳过，否则直接放入结果字符串中，结果字符串直接使用字符串的最前面
***********************************************************************************************/

#include <stdio.h>
void delete_module_str(char *s)
{
    int i=0;
    int j=0;
    while(s[j] != '\0')
    {
        if(s[j]=='w'||s[j]=='l'||s[j]=='c'||s[j]=='m')
            j++;
        else
            s[i++]=s[j++];
    } 
    s[i]='\0';
}

int main(int argc, char const *argv[])
{
    char s[]="welcome to beijing!";
    delete_module_str(s);
    printf("%s\n",s);
    return 0;
}
